% 2o ερώτημα
A=[0 1 0 0 0 0 0 0 1 0 0 0 0 0 0;
0 0 1 0 1 0 1 0 0 0 0 0 0 0 0;
0 1 0 0 0 1 0 1 0 0 0 0 0 0 0;
0 0 1 0 0 0 0 0 0 0 0 1 0 0 0;
1 0 0 0 0 0 0 0 0 1 0 0 0 0 0;
0 0 0 0 0 0 0 0 0 1 1 0 0 0 0;
0 0 0 0 0 0 0 0 0 1 1 0 0 0 0;
0 0 0 1 0 0 0 0 0 0 1 0 0 0 0;
0 0 0 0 1 1 0 0 0 1 0 0 0 0 0;%
0 0 0 0 0 0 0 0 0 0 0 0 1 0 0;
0 0 0 0 0 0 0 0 0 0 0 0 0 0 1;
0 0 0 0 0 0 1 1 0 0 1 0 0 0 0;
0 0 0 0 0 0 0 0 1 0 0 0 0 1 0;
0 0 0 0 0 0 0 0 0 1 1 0 1 0 1;
0 0 0 0 0 0 0 0 0 0 0 1 0 1 0;];
G=findGoogleArray(A,0.15);
fprintf('O πίνακας G και ο πίνακας p του ερωτήματος 2 είναι :')
display(G);
b=PowerMethod(G);
p=kanon(b);
display(p);
p11=p(11); %κρατάω το page rank της σελίδας 11 καθώς μου χρειάζεται στο ερώτημα 5.

% 3o ερώτημα
A2=[0 1 0 0 0 0 0 0 1 0 0 0 0 0 0;
    0 0 1 0 1 0 1 0 1 0 0 0 0 0 0;
    0 1 0 0 0 1 0 1 0 0 0 0 0 0 0;
    0 0 1 0 0 0 0 0 1 0 0 1 0 0 0;
    1 0 0 0 0 0 0 0 0 1 0 0 0 0 0;
    0 0 0 0 0 0 0 0 0 1 1 0 0 0 0;
    0 0 0 0 0 0 0 0 0 1 1 0 0 0 0;
    0 0 0 1 0 0 0 0 0 0 1 0 0 0 0;
    0 0 0 0 1 1 0 0 0 1 0 0 0 0 0;         % Στην στήλη 9   κάνω ένα τα στοιχεία στις γραμμές 2-4-12.
    0 0 0 0 0 0 0 0 0 0 0 0 1 0 0;
    0 0 0 0 0 0 0 0 0 0 0 0 0 0 1;
    0 0 0 0 0 0 1 1 1 0 1 0 0 0 0;
    0 0 0 0 0 0 0 0 1 0 0 0 0 1 0;
    0 0 0 0 0 0 0 0 0 1 1 0 1 0 1;
    0 0 0 0 0 0 0 0 0 0 0 1 0 1 0;];
G2=findGoogleArray(A2,0.15);
fprintf('Στο ερώτημα 3 η τιμή πριν την αλλάγη είναι: %f \n',p(9))
b2=PowerMethod(G2);
p2=kanon(b2);
fprintf('και  η τιμή μετά την αλλάγη είναι: %f \n',p2(9));


% 4o ερώτημα
% (i)
fprintf('O πίνακας G και ο πίνακας p του ερωτήματος 4 για q=0.03 είναι :')
Gg=findGoogleArray(A,0.03);
bb=PowerMethod(Gg);
pp=kanon(bb);
display(pp);
% (ii)
fprintf('O πίνακας G και ο πίνακας p του ερωτήματος 4 για q=0.7 είναι :')
Gg1=findGoogleArray(A,0.7);
bb1=PowerMethod(Gg1);
pp1=kanon(bb1);
display(pp1);


% 5o ερώτημα   (douleuei giati anevainei to rank tou 11)
A3=[0 1 0 0 0 0 0 0 1 0 0 0 0 0 0;
   0 0 1 0 1 0 1 0 0 0 0 0 0 0 0;
   0 1 0 0 0 1 0 1 0 0 0 0 0 0 0;
   0 0 1 0 0 0 0 0 0 0 0 1 0 0 0;
   1 0 0 0 0 0 0 0 0 1 0 0 0 0 0;
   0 0 0 0 0 0 0 0 0 1 1 0 0 0 0;
   0 0 0 0 0 0 0 0 0 1 1 0 0 0 0;
   0 0 0 1 0 0 0 0 0 0 2 0 0 0 0;
   0 0 0 0 1 1 0 0 0 1 0 0 0 0 0;
   0 0 0 0 0 0 0 0 0 0 0 0 1 0 0;
   0 0 0 0 0 0 0 0 0 0 0 0 0 0 1;
   0 0 0 0 0 0 1 1 0 0 2 0 0 0 0;
   0 0 0 0 0 0 0 0 1 0 0 0 0 1 0;
   0 0 0 0 0 0 0 0 0 1 1 0 1 0 1;
   0 0 0 0 0 0 0 0 0 0 0 1 0 1 0;];
G3=findGoogleArray(A3,0.15);
b3=PowerMethod(G3);
p3=kanon(b3);
fprintf('Στo ερώτημα 5 παλιό page rank της σελίδας 11 είναι : %f \n',p11)
fprintf('ενώ το νέο είναι : %f \n',p3(11))

% 6o ερώτημα 
fprintf('O πίνακας G και ο πίνακας p του ερωτήματος 6  είναι :')
A4=[0 1 0 0 0 0 0 0 1 0 0 0 0 0;
    0 0 1 0 1 0 1 0 0 0 0 0 0 0;
    0 1 0 0 0 1 0 1 0 0 0 0 0 0;
    0 0 1 0 0 0 0 0 0 0 1 0 0 0;
    1 0 0 0 0 0 0 0 0 1 0 0 0 0;
    0 0 0 0 0 0 0 0 0 1 0 0 0 0;
    0 0 0 0 0 0 0 0 0 1 0 0 0 0;
    0 0 0 1 0 0 0 0 0 0 0 0 0 0;
    0 0 0 0 1 1 0 0 0 1 0 0 0 0;
    0 0 0 0 0 0 0 0 0 0 0 1 0 0;
    0 0 0 0 0 0 1 1 0 0 0 0 0 0;
    0 0 0 0 0 0 0 0 1 0 0 0 1 0;
    0 0 0 0 0 0 0 0 0 1 0 1 0 1;
    0 0 0 0 0 0 0 0 0 0 1 0 1 0;];
G4=findGoogleArray(A4,0.15);
b4=PowerMethod(G4);
p4=kanon(b4);
display(p4);
