function y= Simpson(a,b,z) % Δέχεται ως όρισμα τα άκρα του διαστήματος (a,b) και έναν αριθμό z που λέει σε πόσα σημεία 
format long;                % θέλουμε να χωρίσουμε το διαστημα.
syms x;
qq=(b-a)/(z-1);
c=0;
for i=1:z
   A(i,1)=c;                 %Υπολογίζει τα σημεία που χρειαζόμαστε.
   A(i,2)=sin(c);
   c=c+qq;
end
[m,v]=size(A);
n=m-1;
sum=A(1,2)+A(m,2);
t=fix(n/2);
for k=1:t
    sum=sum+4*A((2*k),2);
end
t=fix((n/2)-1);
for k=1:t
    sum=sum+2*A(2*k+1,2);
end
E=(b-a)/(3*n)*sum;     % Το ζητούμενο εμβαδόν.
fprintf('H προσεγγιστική τιμή του ολοκληρώματος είναι: %f\n',E);
e=(((b-a)^5)/(180*(n^4)))*getM(); %Υπολογίζει το σφάλμα προσέγγισης του ολοκληρώματος.
error=double(e);
fprintf('To σφάλμα προσέγγισης του ολοκληρώματος είναι: %f\n',error);
end

function y=getM() % Επιστρέφει την μέγιστη τιμή της 4ης παραγώγου.
    syms x;
    g(x)=sin(x);
    df=diff(g,4);
    y=abs(df(pi/2));
end