function  y= Trapezio(a,b,z) %Δέχεται ως όρισμα τα άκρα του διαστήματος (a,b) και έναν αριθμό z που λέει σε πόσα σημεία 
format long;                % θέλουμε να χωρίσουμε το διαστημα.
syms x;
qq=(b-a)/(z-1);
c=0;
for i=1:z
   A(i,1)=c;         %Υπολογίζει τα σημεία που χρειαζόμαστε.
   A(i,2)=sin(c);
   c=c+qq;
end
[m,v]=size(A);
n=m-1;
sum=A(1,2)+A(m,2);  % Προσθέτει το πρώτο και το τελευταίο σημείο.
for i=2:n
    sum=sum+2*A(i,2);   % Προσθέτει τα ενδιάμεσα σημεία.
end
E=(b-a)/(2*n)*sum; % Το ζητούμενο εμβαδόν.
fprintf('H προσεγγιστική τιμή του ολοκληρώματος είναι: %f\n',E);
e=(((b-a)^3)/(12*(n^2)))*getM(); %Υπολογίζει το σφάλμα προσέγγισης του ολοκληρώματος.
error=double(e);
fprintf('To σφάλμα προσέγγισης του ολοκληρώματος είναι: %f\n',error);
end

function y=getM() %Επιστρέφει την μέγιστη τιμή της 2ης παραγώγου.
    syms x;
    g(x)=sin(x);
    df=diff(g,2);
    y=abs(df(1));
end

